label part9:
    #─────────────────
    show 小东 7012:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "呼、呼，总算到了。\nは...は...やっと着いた..."
    "自信过头了，即使降低了难度，整个路程还是比我想象得要艰辛不少\n自信しすぎた。難易度を下げたとはいえ、思ったよりきつかった。"
    "还好，眼前就是终点，代表胜利的皇冠就在几步之遥了\n幸い、ゴールは目の前だ。勝利を示す王冠もすぐ取れる。"
    #【希望能用king里的皇冠】
    小东 "说起来，那家伙又去哪了？\nところで、あいつはどこに行った？"
    "四处张望了一下，那个粉色的糖豆人，把我甩得远远的后，就消失不见了\n見回したけどあのピンクの子は見当たらなかった。ひとなのずっと前に行っちゃって消えたみたい。"
    小东 "算了，先拿到再说！\nまぁいいか。取ったあとの話よ！"
    "忍不住激动起来，手伸了过去\n衝動を抑えずに手を伸ばしていく。"
    "触碰到皇冠的瞬间，世界再次发生了变化\n王冠に触れた瞬間、世界はまた変わっていた。"
    #【背景切换】
    "随着一道光芒，周围的场景又变回了立体的样子\n一筋の光が掠れて、周囲は立体的な感じに戻った。"
    小东 "（啊……变回来了）\n（ああ...！戻ってきた！）"
    小东 "（射影机的特效被解除了？）\n（射影機の効果が解除されたかな？）"
    "我也恢复成原本的身体\n自分も元の様子に戻った。"
    "同时，突然发现原本摆放着皇冠的台子，出现了另一个身影\nその同時に、元々王冠が置かれた台に、別の人影が現れてきた。"
    "站在台子上的，是个很小的家伙。\nそこに立ているのは、体がとても小さい子だ。"
    "瘦小的身躯，穿着黄色的雨衣，尖尖的帽子，看不清脸\n細い体に尖った帽子の黄色レインコートがかけられている。顔はよく見えない。"
    小东 "（这小家伙是！小小梦魇里的主角——）\n（この子は...！リトルナイトメアの主人公の）"
    小东 "小六！\nシックスちゃんだ！"
    "对方似乎对这个名字有反应，但只能发出些许低小的声音，挥舞着手臂\nこの名前に反応をしたように、シックスちゃんは手を振り始めたけど、微かな小さい声しか出せていない。"
    小东 "（又是无法沟通的类型啊）\n（また交流できないタイプか...）"
    小东 "不过，这个世界的套路，我大概已经摸清楚了。\nけど、ひとなはもうこの世界のルールを把握してたぞ！たぶん！"
    "从一开始，密室里拿到的“小熊”\n最初の密室でもらった「くまのぬいぐるみ」で"
    "用“小熊”在凉宫杏树那里，换到了“草莓牛奶”\n杏樹ちゃんのところに「イチゴミルク」と交換して、"
    "再用“草莓牛奶”，换来了森岛遥的“思念”\n杏樹ちゃんのところに「イチゴミルク」と交換して、"
    "从“思念”中摆脱出来，得到了不来方夕莉的“射影机”\nその「想い」から抜け出して、夕莉ちゃんの「射影機」を手に入れた。"
    "最后，在糖豆人那里，利用“射影机”的特殊能力，拿到了最后的“皇冠”\n最後のFALL GUYSのところに「射影機」の特殊能力を利用して、この「王冠」を取れた。"
    小东 "也就是说，这本质就是个“以物换物”的规则。\nつまり、ルールの本質は「物々交換」だ。"
    "想通这一点，思路便豁然开朗起来\nこの一点だけを見通したら、頭もふっと明晰になってきた。"
    小东 "这应该就是最后的交换吧。\nたぶんこれは最後の交換じゃないか？"
    "我将皇冠递了过去，交给“小六”\n王冠をシックスちゃんに渡す。"
    "出乎意料的是，它却摇了摇头，推开了皇冠\n予想に外して、彼女は頭を振って、王冠を押しのけた。"
    小东 "不对吗……\n違うの...？"
    小东 "那么，这样的话呢？\nなら、これはどうだ！"
    "我闭上眼，端坐下来，双手举着皇冠，缓缓戴到了自己的头顶上\nそっと目を閉じて腰を下ろし、両手であげられていた王冠をゆっくりと自分の頭に被る。"
    #【CG】
    "噗通一声，那华丽的皇冠，变成了一顶可爱的生日帽\nぷちっの音とともに、あの華麗な王冠は可愛いパーティーハットになった。"
    "惊讶的睁开眼，才发现，“小六”双手捧着个大大的蛋糕，举到我面前\nその突然なことに驚いて目を開いたら、シックスちゃんは自分の体より大きいケーキをひとなの前に運んできてくれた。"
    #【差分CG】
    小东 "这个是……\nこれは......"
    小东 "这才是最后的交换吗？\nこれこそ最後の交換か..."
    #【BGM希望能用舒缓一点的，钢琴版的生日歌】
    "我有些懵懂，接过小六的蛋糕\nまだ状況を理解していないけれど、シックスちゃんからケーキを受け取る。"
    "与此同时，周围响起了零零散散的掌声\nそして、周りに散らばっている拍手の音もし始めた。"
    image text1 = Text("【2020年5月6日 花寄女子寮4人雀魂】\n【2020年5月6日 花寄女子寮雀魂コラボ】", size=30)

    show text1:
        left
        xpos 0
        ypos 0.1
    凉宫杏树"恭喜 \nお誕生日おめでとうございます。"
    hide text1
    image text2 = Text("【2020年5月10日 圣诞之吻】\n【2020年5月10日 アマガミ】", size=30)

    show text2:
        left
        xpos 0
        ypos 0.1
    森岛遥 "恭喜\nお誕生日おめでとう！"
    hide text2
    image text3 = Text("【2020年5月13日 零 ～濡鴉ノ巫女】\n【2020年5月13日 零 ～濡鴉ノ巫女】", size=30)

    show text3:
        left
        xpos 0
        ypos 0.1
    不来方夕莉 "恭喜\nお誕生日おめでとうです！"
    hide text3
    image text4 = Text("【2020年8月16日 Fall Guys 糖豆人】\n【2020年8月16日 Fall Guys 】", size=30)

    show text4:
        left
        xpos 0
        ypos 0.1
   

    糖豆人 "@#@%#%\n@#@%#%"
    hide text4
    #"【边框里的文字，希望能放在画面角落】"

    "它们围在四周，绕着自己，笑着鼓起了掌\n彼女たちはひとなを囲んでいて、笑いながらパチパチをしてくれている。"
    image text5 = Text("班尼特福迪【2020年6月21日 Getting Over It】ベネット・フォディ【2020年6月21日 Getting Over It】\n凯瑟琳【2020年7月4日 凯瑟琳Full Body】キャサリン【2020年7月4日 キャサリン・フルボディ】\n祖迪·霍姆斯【2020年9月20日 超凡双生】ジョディ・ ホームズ【2020年9月20日 BEYOND: Two Souls】\n阿鲁夫【2020年11月13日 皮克敏3】アルフ【2020年11月13日 ピクミン3】\n花子【2020年12月26日 花子】花子【2020年12月26日 トイレの花子さん】", size=30)

    show text5:
        left
        xpos 0
        ypos 0.2
    "放眼望去，不仅是这些人，远处还有很多游戏角色的影子，都在鼓掌和祝福\nちゃんと見れば、この人達だけじゃなく、後ろにもたくさんのゲームキャラが拍手とお祝いをしてくれてる。"
    hide text5

jump part10