label part7:
    #─────────────────
    play music sei fadein 1.0
    不来方夕莉 "怎、怎么会？\nそ、そんな…"
    "她的脸色不太好看，握着射影机的手有些发抖\n夕莉たん顔色が悪そうに見えるし、手もちょっと震えている"
    show 小东 5211:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "没关系吗？要不要休息一下？\n大丈夫？一休みしない？"
    "之前也提过，这个少女能看到我看不到的东西\n前にも言ったけど、彼女はひとなに見えないものが見えるんだ"
    "这包括一些恐怖的景象，想必刚刚驱魔的过程中，她也承受着大量的心理压力\n怖いものも含まれている。先ほどの除霊で、さぞ大きなプレッシャーを受けたんだろう"
    不来方夕莉 "不，不该是这样的。\n違う、こんなはずじゃなかった。"
    不来方夕莉 "我们明明已经清除了所有结界的依存点，应该能够出去了才对——\n私たちは結界の憑依点を全て排除したから、もう出られるはず…"
    show 小东 2113:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "但是，没有任何变化。\nしかし、何の変哲もないな。"
    "夕莉的驱魔没有成功，我们依然被困在无限的走廊里，无法逃脱\n夕莉たんの除霊が成功せず、ひとなたちはなおこの無限に続く廊下に閉じ込められていて、脱出できないんだ"
    不来方夕莉 "到底哪里出了问题……\n一体どこで間違っているのだろうか…"
    "埋着头的夕莉，语调渐渐变得沮丧，我在她身边蹲坐下来\n頭を垂れている夕莉たん、その口調もだんだん落ち込んでしまう。ひとなはその隣にうずくまった"
    show 小东 1022:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "说起来，这个能拍照，对吗？\nそう言えばさ、これって撮影できるよね？"
    不来方夕莉 "等等！这个是——\nちょっ！これはー"
    "我装作没听清，拿过她手中的“射影机”，反握过来，镜头对准自己\n聞こえないふりをして、彼女が持っている射影機を取ってきた。逆方向に握って、レンズを自分に向けた"
    show 小东 1011:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "笑一个吧？\nさぁ、笑って～"
    "最后一秒，我往右摆头，凑了过去\n最後の瞬間に、頭を右に偏って"
    "靠在她的肩上，露出轻快自然的 容，还比了个剪刀手\n夕莉たんの肩に寄りかかって、明るい笑顔を咲かせながらVサインを構えた"
    "按下了快门\nそのままシャッターを切った"

    stop music
    with flash
    "喀嚓【闪光特效】\nカシャー"
    不来方夕莉 "欸、欸？\nえっ、え？"
    "照片上是我们的合照\nひとなと夕莉たんのツーショットが映っている"
    "但与我的愉快不同，夕莉一脸惊慌失措的样子，手脚都不知道该怎么放\n楽しんでいるひとなと違って、彼女は慌てそうで手足も置く場所がないようになった"
    "简直就像情侣拍的大头贴\nまるでカップルたちが撮ったプリクラみたいだ"
    #【CG】
    show 小东 1021:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "你看，愁眉苦脸的话，可就没这么可爱了哦？\nほら、そんな憂鬱な表情をして、可愛い顔が台無しだよ？"
    不来方夕莉 "等等——\n待ってください…"
    "然而，她却像没听见我的这句话，面色凝重，指着前方\nけれど夕莉たんはひとなの話が聞こえなかったように、青ざめた顔をして、前を指し示している"
    "顺着看去，射影机发出了幽幽的光芒，握着的手心隐隐有些发烫\n眼差しを向ける方向に、淡く光っている射影機が見える。射影機を持つ手が少し暑くなってきた"
    "能感觉出来，它在发生什么变化\n何らかの変化が起きているのが感じられる"
    show 小东 4111:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "（遭了，不会被我弄坏了吧？）\n（やべぇ、ひとなに壊されたんじゃないよね？）"
    "光芒的凝聚依然在继续，周围的阴影被破开\n光がまだ集っている。周りの影がだんだん消されていく"
    "射影机的镜头处，亮起一道模糊的光点，在漆黑的走廊里，十分耀眼\n射影機のレンズのところに光の玉が幽かに光ってきた。この真っ暗な廊下にとても輝いて見える"

    play music fusi fadein 1.0
    不来方夕莉 "啊！\nあっ！"
    不来方夕莉 "我、我明白了！\nわ、分かった！"
    不来方夕莉 "原来是这样，原来是这样。\nなるほど、そういうことか。"
    不来方夕莉 "结界没有消失的原因，其实很简单\n結界が消えない原因は極めて単純だった。"
    不来方夕莉 "因为这个困境的核心，根本不在于那些旁支——\nだってそのコアはそんな疎いことにあるのではなく、"
    "她突然转过头来，直直望着我\n急に振り向いて、真っ直ぐにひとなを見つめている"
    不来方夕莉 "被困住的原因在于你自己，小东\n小東さん、あなた自身にあるのよ。"
    show 小东 5211:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "我？\nひとなに？"
    "愣住了\n呆然とした"
    不来方夕莉 "我看到了，之前的场景\n私見たよ、この前のシーンを。"
    不来方夕莉 "那个和你在这里行走的女孩子，她在这段二人独处的时间里，心底偷偷产生了一个想法\nあなたと一緒にここに歩いていた子は、二人っきりの時間にある想いを生んだのだ。"
    不来方夕莉 "“啊，要是能永远两个人在这里被困住，似乎也不错呢。”\n『ああ、ずっと二人で閉じ込められても悪くないな』ってね。"
    小东 "！！"
    不来方夕莉 "这短暂的想法，被这个环境捕捉下来\nその一瞬の想いがこの場所に捕らえられた。"
    不来方夕莉 "在这种特殊的环境里，收到强烈的情绪影响\nこの特別な環境で強い感情に影響されて、"
    不来方夕莉 "它转化为现实，形成了无法逃脱的回廊\n現実になり、逃れられない廊下になった。"
    "夕莉指了指闪着光的射影机\nそして夕莉たんは光る射影機を指した"
    不来方夕莉 "刚刚射影机拍到你自己，巧合之下，才成功解除了结界\nさっき射影機があなた自身を撮ったから、偶然に結界を解いた。"
    不来方夕莉 "依照我们之前的做法，只是徒劳无功而已\n前の私たちのやり方では、どう足掻いても無駄なのだ。"
    "那个凝聚出的光点，在漆黑的环境里显得极为耀眼，但我却一时不忍掐灭它\nこの暗闇の中、集ってきた光の玉がすごく眩しいけど、それを消したくない"
    hide 不方
    show 小东 5111:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "原来……是这样\nそう…だったのか。"
    "她口中的“那个女孩子”，恐怕指的就是森岛学姐\n夕莉たんが言っていたあの子は、恐らく森島先輩だろう"
    "夕莉拥有的影见能力，让她能看到过去发生的事情，梳理出了事件的缘由\n彼女が持ってる「影見」が彼女に過去にあったことを見せてくれたから、事件の経過を整理できた"
    小东 "（真是没想到）\n（思いもしなかったな。）"
    "森岛学姐本不带恶念的思绪，阴差阳错下，让我被困在了这里\n森島先輩が悪意を持たずに、偶に間違ってひとなを閉じ込めたんだ"
    "她给我留下的东西，不是什么实质的物体，只是单纯的一个念头\n彼女がひとなに残ったのは、実在する物ではなく、たった一つのシンプルな想いだった"
    "“想要二人的独处”\n「二人っきりになりたい」"
    show 小东 1022:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "我听到了哦。\n聞こえてるよ。"
    "手心贴了过去，那颗光点迅速融入进了我的身体，消失无踪\n手のひらをくっつけたら、光の玉がすぐ体に溶け込んで、消えてしまった"
    "几乎是同一时间，周围的走廊背景，如同拼图的碎片般，破裂、剥离掉了\nほぼその同時に、周りの廊下はパズルのピースのように引き裂いて、剝がれ落ちていた"
    
    stop music fadeout 1.0
jump part8