label part5:
    show 小东 2013:
        zoom 0.5
        right
        crop(0,0,2000,1800)       
    小东 "嗯，这里就是出口，没错吧？\nえっと、ここは出口...かな？"
    "虽然不知道为什么走廊会排列得像迷宫一样，甚至还会来回移动\nなぜか廊下は迷宮のような仕組みになっている上、往復移動もできる。"
    "总之，经过好一番努力，总算是走到了尽头\nとにかく、色々頑張っていてようやく廊下の果てに着いた。"
    show 小东 1021:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "真是不容易呢，森岛学姐。\n本当大変でしたね、先輩。"
    小东 "森岛、学姐？\nもりしま、せんぱい？"
    "回过头来，我却愣住了\n振り返ったら、目の前の光景に驚いた。"
    森岛遥 "走了这么久，口渴啦——\nいっぱい歩いて喉乾いたーー"
    "她正举起那盒草莓牛奶，津津有味的品尝着\n森島先輩はうまそうにそのイチゴミルクを味わっている。"
    "虽然仰起的颈脖线条很好看，但现在不是欣赏这个的时候\n仰向けでキレイな首のラインも丸見えになったけど、今はそれを鑑賞する場合じゃない。"
    "从凉宫杏树那里拿到的重要物品【草莓牛奶】，应该有什么关键的用途才对！\n杏樹ちゃんからもらった「イチゴミルク」はきっと何かに使うはずだ！"
    森岛遥 "嗯？怎么了？\nん？どうしたの？"
    "她似乎察觉到了我异样的眼神，犹疑着停下动作，咽了下口水\nこっちから異様な目線を察したように、森島先輩は躊躇いつつ動きを止めて、つばを飲み込んだ。"
    森岛遥 "难不成……是很重要的东西吗？\nもしかして......これはすごく大事なものなの？"
    show 小东 5211:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "啊、看来效果还挺明显的。\nああ、それにしても割と効きますね。"
    "低下头发现森岛学姐的脚，已经变得透明起来\n森島先輩の足はすでに透明になった。"    
    show 小东 7012:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "（和凉宫杏树那时一样，这是传送的前兆……）\n（杏樹ちゃんの時と同じ、これは転移の前兆だ。）"
    show 小东 5111:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "喝这个真能回去？！\nこれを飲んだら本当に帰れるんだ？！"
    "没想到自己随口的猜测，居然变成了现实，太荒唐了\n適当に妄想したことは本当に現実になったなんて、そんなばかな。"
    "森岛学姐也发现了这点，惊慌失措地冲了过来\n森島先輩も気づいたように、急いでこっちに慌てて寄ってきた。"
    森岛遥 "总之！总之！\nと、とにかく！"
    "她把牛奶盒子慌乱的塞进我手里\n手のひらにパックが突っ込まれた。"
    森岛遥 "还剩下一半噢！快喝！\nあと半分ぐらい残ってるよ！はやく飲んで！"
    show 小东 4211:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "嗯？嗯！\nは、はい！"
    "来不及想间接接吻之类的事情了，深吸一口气，把剩下的灌入喉咙中\n間接キスとかのことを気にする暇もない。深く息を吸い込み、残った分を一気に飲みきる。"
    "普通的草莓牛奶味，酸酸甜甜，并没有什么特别的\n甘酸っぱいで、普通のイチゴミルクの味がした。特に特別なところ一つもなかった。"
    #─────────────────
    #─────────────────
    #草苺牛奶原本能增长小东待在梦境的时间，
    #会没效是因为杏树拿错，拿成了普通的牛奶
    #学姐原本应该也要给小东东西，但因为慌乱的关系全忘了
    #─────────────────
    #─────────────────
    森岛遥 "怎么会……\nそんな......"
    "她欲言又止的表情，像是知道什么隐情，但我却没有细究，不忍破坏这个气氛\n何か言いたい顔をしている森島先輩は、なにか事情を知っているようだ。でもこの雰囲気を破りたくないから、問い詰めはしないようにした。"
    show 小东 9011:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "看来没有效果呢。\n僕には全然効いてないですね。"
    "自己的身体完全没有变化，没有模糊、也没有透明\n自分の体には一切の変化もない。ぼんやりも、透明化も、兆しすら出てこない。"
    "但与此同时，森岛学姐的“消失”还在继续，已经快到腰部了\n一方、森島先輩の「消散」はまだ続いている。すでに腰に至る。"
    "我被拒绝传送了\n自分の転移は拒絶された。"
    show 小东 7012:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "（和之前那只小熊一样，这些物品只对游戏角色起作用，却不能把我带回原来的世界。）\n（前のぬいぐるみと同じで、これらのアイテムはゲームキャラにしか効かないのようで、ひとなを元の世界に連れ戻すのはだめか。）"
    小东 "不要露出这种表情噢，这不是森岛学姐的错。\nそんな顔しないでください。これは森島先輩のせいじゃないです。"
    森岛遥 "可是——\nでも..."
    "我打断了她\n先輩の話を中断した。"
    show 小东 4211:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "这样下去，要来不及道别了。\nこのままじゃ、お別れの時間もなくなりますよ。"
    "森岛遥没有回话，她咬着嘴唇，突然两只手揽住我的脖子，深深抱了上来\n返事がない。森島先輩は唇を噛みながら、突然両手でひとなの首を抱えて、強く抱きしめてきた。"
    #【CG】
    森岛遥 "看来只能陪你到这里了。\nどうやらここまでだ。"
    show 小东 8012:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "唔、唔——！\nう、うーー！"
    森岛遥 "我会等着的，小东，一定、一定要再见。\n待ってるから。絶対、絶対にまた会おうね。"
    "随着耳边低声的呢喃，力道骤然消散\n耳のそばで響いた囁きとともに、抱きしめられた触感も消えてしまった。"
    "回过神来，四处张望也找不到那个身影，只留下她身上淡淡的清香\n気がついてきた時、周りにあの姿は見当たれなかった。残されているのは、ただ彼女のかすかな清々しい香りだった。"
jump part6