label part8:
    #─────────────────
    "在那之后，我同夕莉小姐道了别\nそのあと、夕莉さんと別れました"
    "不过，在走之前，她留下了一样东西\nでも、行く前に、彼女はあるものを残しました"
    不来方夕莉 "这个你拿着吧。\nこれ持って行こう。"
    #图片【射影机】
    "那个拥有神秘力量的相机，在这个“异世界”里，说不定用得着\nその神秘な力をもつカメラは、この“異世界”で使えるかもしれない"
    小东 "但是——\nでも——"
    小东 "这里的古怪程度也太高了吧！\nここ風変わりぎるでしょう！"
    "还是忍不住吐槽了\nやっぱり耐えれないツッコミました"
    小东 "（这地方的画风，变得也太突兀了）\n（ここの画風、変わりも唐突すぎる）"
    "那阴森的走廊消失后，我就出现在了这里\nあの不気味な廊下消えたあと、私はここに現れました"
    "明亮充足的光线，四周全是鲜艳的配色，大块的砖面\n明るくて充分な光、周りはすべて鮮やかな配色、大きなレンガの面"
    "就连地板都充满了弹性，似乎轻轻一跳就能蹦起来\nゆかまで弾力に満ちている、軽く跳ねることができるようです"
    小东 "（好像从恐怖片场景，突然到了儿童乐园一样）\n（ホラー映画みたいな場所だ、急にキッズパークに着いたように）"
    "然而，直到看到下个出场的游戏角色，我才终于明白\nすると、次の登場キャラクターを見て、やっとわかりました"
    "这份莫名其妙的熟悉感，到底从何而来\n"
    小东 "你、你是——\nあ、あなたは——"
    小东 "FALL GUYS（糖豆人）？？\nFALL GUYS？？"
    "眼前是一个庞大的粉色物体，椭圆的蛋形，圆滚滚的四肢\n目の前には巨大なピンクの物体、楕円の卵形、丸々の四肢"
    "可爱是挺可爱的，但实际放到眼前时，总有种古怪的感觉\n可愛いは可愛いけど、実際に目の前にいる時、何が変な感じする"
    小东 "（尤其是发现这家伙比我还高不少的时候）\n（特にこいつが私より背が高いことに気づいた）"
    糖豆人 "\#\￥\%…\$\^\&\*\n"
    "“那家伙”手舞足蹈，发出一连串奇怪的音节\n“あいつ”は踊りして、一連の奇妙な音節を発した"
    "似乎在说话，但我无法理解它想要表达什么\n話しているようですが、何を表現したいのか理解できない"
    小东 "（没法沟通吗……这下麻烦了。）\n（通じできないのか……困ったな。）"
    "毕竟之前遇到的几位美少女，都是正常的人类，没想到这下难度骤增\n前に出会った美少女たちは普通の人間だったので、急に難易度アップして思わなかった"
    小东 "（忘了还有这种游戏角色存在啊。）\n（こんなキャラクターがいるのを忘れた。）"
    小东 "呃、你、知道、怎么才能、出去吗？\nえっ、えっと、どうやって、外に出るのか、知ってますか？"
    "我一顿一顿说着话，伴以大量的肢体语言\n私は大量のボディーランゲージをして、そして話をしている"
    糖豆人 "（点点头，指向了远处。）\n（うなずいて、遠くを指さした。）"
    "看来似乎成功了，我顺着看去\n成功したみたいだ、私は見に行った"
    "那是条很长的路，浅绿色的地面一直延伸到地平线外，看不清尽头\nそれは長い道で、薄い緑の地面は地平線の外まで延びている、終点がよく見えません"
    小东 "难道说，终点就是回家的路？\nもしかして、終点は帰り道？"
    "但是，路上遍布着大量的障碍和机关\nでも、路には大量の障害物や仕掛けが広がっている"
    "就像游戏里的那些，滚轮、摆锤、旋转轮盘、到处挥舞的杆子\nゲームの中みたい、ローラー、ハンマー、ルーレット、あちこちを振える棒"
    "发出令人不安的声响\n不安な声を立てる"
    小东 "这……\nこれ……"
    "我下意识后退了一步\n私は無意識に一歩後ずさりした"
    "这和在游戏里玩的时候，根本不是一个难度\nこれとゲームを遊んで時、難易度がぜんぜん違う"
    "不用想就知道，实际被巨大锤子打飞的感觉，绝对不会很好受\n考えずに知って、実際に巨大なハンマーに飛ばされた感じは、絶対嬉しくない"
    "而且，道路的边缘就是高耸的悬崖，我能不能像游戏角色那样复活，还是个未知数\nそして、道の端は高い崖、私がゲームキャラクターのように復活できるかどうかまだ未知数"
    小东 "要怎么才能——\nどうすればいいのか——"
    "刚转过头来想要求助，却发现那个粉色的家伙已经往前冲去了\n振り返って助けを求めようとしたが、でもあのピンクのやつが前に飛び出していた"
    "一晃一晃，速度挺快，转眼间就越过了不少障碍\nゆらゆらして、スピードはとても早く、またたく間に多くの障害を越えた"
    小东 "好强……\nつよ……"
    小东 "不对，我要怎么办、怎么办？\nいや、どうすればいい？どうしよう？"
    小东 "硬着头上吗，等等，怎么想都太危险了吧！\nやるしかないか、ちょっと、どう考えても危険すぎるでしょう！"
    "就在这时，突然灵光一现！\nその時、急にひらめいた！"
    小东 "等等，这个时候——\n待って、その時——"
    "我突然想到了什么，拿出背包里的物品，射影机\n私突然何かを思い出した、カバンの中のもの出して、射影機"
    "对着眼前的漫长赛道，按下了快门\n目の前の長いコースに向かって、シャッターを押した"
    #【喀嚓】
    #【背景更换】
    小东 "真的假的——\nマジかよ——"
    小东 "还有这种功能？！\nこんな機能もあるの？！"
    "没错，这个拥有神秘力量的相机，居然把整个世界压缩成了2D的平面\nそう、この神秘な力を持つカメラは、世界を2 Dの平面に圧縮しました"
    "不仅是赛道而已，甚至我的样子都被改变了\nコースだけじゃなくて、私の様子まで変わった"
    小东 "（真是新奇……）\n（珍しいな……）"
    "不过，这样下来，胜利的法则就确定了\nでも、これで、勝利のルールが確定した"
    "由于赛道被压缩的关系，道路上的障碍也被大量的简化\nコースが圧縮されている関係で、道上の障害も大量に簡略化されだ"
    "没有了高处坠落的危险，即便是不擅长运动的我，也能轻松通关\n高いところに落ちる危険はなくなった、運動が苦手な私も簡単にクリアできます"
    小东 "好！\nよし！"
    小东 "那就出发吧！\nじゃ行きましょうか！"       
    #call screen dino
    #链接游戏


    #─────────────────
    #─────────────────
    #【chrome那个断网的小恐龙游戏
    #跳跃躲避障碍的
    #拿到某个分数（距离）就通关
    #希望小东能穿上糖豆人里的薯条服装】

    #首次失误台词：
    #小东 "嗯，怎么道路又变长了？"
    #小东 "嘛，事到如今也没有退路了，继续前进吧！"
    #避免重复，之后的失误都直接重启
    #─────────────────
    hide 小东
    scene gray with fade
    $ quick_menu = False

    call screen dino

    $ quick_menu =True

    jump part9
