label part2:
    "醒过来时，发现身处一个漆黑的房间\n意識が戻った時、もう真っ暗の部屋にいる。"
    "没有光源，伸手不见五指，看不清周围的布置\n光源がないせいで、自分の手すら見えない暗闇に包まれていて、周りの配置も全然見えない。"
    "唯一能知道的就是，这里不是熟悉的地方\n唯一わかるのは、ここは知っている場所ではない。"
    show 小东 2113:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "这里是……哪里？\nここは......？"
    谜之声 "恭喜！小东人鱼，你被抽选中我们的“异世界转生”大奖！在这个新的世界里，开启一段美好的旅程吧！\nおめでとうございます！小東ひとなさん！あなたは私たちの抽選で「異世界転生」の大当たりを当てました！この新しい世界で、素敵な旅を始めましょう！"
    小东 "哈？\nはっ？"
    show 小东 4111:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "等等等等，给我解释清楚！\nまてまてまてまてい！ちゃんと説明してくれ！"
    谜之声 "恭喜！小东人鱼，你被抽选中我们的“异世界转生”大奖！在这个新的世界里，开启一段美好的旅程吧！\nおめでとうございます！小東ひとなさん！あなたは私たちの抽選で「異世界転生」の大当たりを当てました！この新しい世界で、素敵な旅を始めましょう！"
    show 小东 5211:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "不是让你重复一遍啊！\n復唱させるんじゃねんだよ！"
    小东 "送我回去啊！\n帰らせてよ！"
    谜之声 "恭喜！小东……\nおめでとうございます！こひが......"
    谜之声 "诶？\nえっ？"
    谜之声 "这可是给你的生日惊喜噢？\nこれはあなたのために用意した誕生日サプライズなんですよ？"
    show 小东 4111:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "生日才不会想在异世界过啦！\nだれが異世界で誕生日を過ごしたいんだよ！"
    show 小东 7112:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "（而且，如果突然消失了的话，晴琉琉她们会很担心的吧。）\n（それに、突然いなくなったらぱれるんたちにも心配かけちゃうし。）"
    谜之声 "我还以为最近很流行这个……嗯，看来还需要再调查一下。\n最近流行ってると思いこんでしまって......ふむ、どうやら調査が足りていなかったようですね。"
    谜之声 "不管怎么说，传送门很快就会关闭。\nとりあえず、ポータルはもうすぐ閉じますので"
    谜之声 "一定要记住，如果今天之内没能回到原来的世界，就只能永远滞留在这里了。\nもし今日のうちに元の世界に戻れなかったら、永遠にここに滞在することになるだけは覚えときなさい。"
    谜之声 "总之，请好好加油吧。\n以上です。せいぜい頑張りましょう。"
    show 小东 5211:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "解释清楚啊！要怎么回去啊？\nおい！ちゃんと説明しろよ！どうすれば帰れるんだ？"
    小东 "既然是你带我过来的，肯定会有办法的吧？\nあんたがひとなを連れてきたからきっとなにか方法あるでしょ？"
    谜之声 "…………\n"
    "然而，之后的呼唤，都再也没有传来回应\nでも、その後いくら叫んでも、返事は来なかった。"
    "空旷的房间里，只能听到自己的回声\n空っぽの部屋に自分のこだましか聞こえない。"
    show 小东 2013:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "真是不负责任……\n本当に無責任のやつだな......"
    小东 "说起来也忘记问了，那家伙到底是谁啊？\nそういえば、あいつは誰なのかも聴き忘れちゃったね。"
    "只看到一个模糊的影子，其他什么线索都没有\nぼんやりとした影しか見えなかった上に、他になんの手がかりもない。"
    "突然，房间里亮起了灯，头顶也似乎出现了什么东西\nそう思っていた瞬間、いきなり部屋に電気がつけされ、頭の上にある空間にもなにかが見えそうになった。"
    "能够看清，到处摆满了各种东西，房门被紧锁着\n色んな品物が並んでいて、ドアがロックされている部屋だと確認できた。"
    小东 "看这个机关的设置，似乎需要3种东西解锁。\nこの装置の様子によって、解除することには3つのものが必要されてるようだね。"
    小东 "总之，只能想办法出去了吧。\nとりあえず、やるしかないか。"
    
    #"游戏设置 "
    #"顶部有待在梦境的时间"
    

                
 
    #"密室的核心是寻找物品 "
    #"分别对应着1107的物品（棒球，电影票，游戏截图）"
    #"集齐后才能打开密码锁"
    #"除此之外，彩蛋是一个玩具熊（是监视器）"
    #"以下是分别找到每一个物品的台词 "

    #小东 "这个似乎没什么用，看看别的吧。"
    #小东 "这不是去年砸中我脑袋的棒球吗？怎么会在这里？"
    #小东 "这不是去年和小鹿一起去看电影的电影票吗？怎么会在这里？"
    #小东 "这不是去年和ののの玩俄罗斯方块的游戏截图吗？怎么会在这里？"
    #小东 "这个小熊好可爱，要不就带走吧？"
    #─────────────────
    #─────────────────
    #"这里是顺序错误的台词 "

    #小东 "怎么没效果？难不成是放错了？"
    #─────────────────
    #全搜集剧情 
    #小东 "好了，应该是这样吧？"
    #"棒球，电影票，游戏截图\n我按顺序放下对应的三样物品后，门传来了解锁的声音"
    #─────────────────
    #如果未能发现小熊，则会添加以下剧情 
    #小东 "好了，应该是这样吧？"
    #棒球，电影票，游戏截图
    #我按顺序放下对应的三样物品后，门传来了解锁的声音
    #小东 "等等，这是什么？"
    #发现脚边突然多出了一个小熊的玩偶，出于好奇，我拿了起来
    #小东 "难不成是通关奖励，要不就带走吧？"

    jump part3