label part6:
    #─────────────────
    show 小东 11011:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "这走廊也太长了吧……\nなんて長い廊下なんだ…"
    show 小东 2113:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "要走到什么时候，才算个头啊。\nいつまで歩けば尽きるのかしら。"
    show 小东 3013:
        zoom 0.5
        right
        crop(0,0,2000,1800)       
    小东 "真是的，我还要回去过生日呢！\nまったく、帰って誕生日を過ごしたいのに！"
    "大量的自言自语，其实是在试图驱散紧张感\n独り言をたくさん呟いたのは、緊張をほぐすためだった"
    "森岛学姐离开后，我变成了独身一人\n森島先輩が行ってしまったら、ひとなはひとりぼっちになった"
    "也不知道是不是心理作用，感到走廊里的光线都昏暗起来，背后时不时发出古怪的声响\n考えすぎたせいかな、なんか廊下が暗くなっているし、背中にも時々変な音がする"
    "幽深的角落里，不知道藏着什么东西\n黒い角に何かが潜んでいるのかな"
    show 小东 13111:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "（不妙啊……）\nやばびぶだよ…"
    "几次都想要往回逃跑，但回家的执念还是让我勉强坚持了下来\n何度も振り向けて逃げようとしたけど、うちに帰りたいという想いのおかげで何とか堪えた"
    "忍着恐惧心继续向前\n恐怖心を抱えたまま前に進んでいる"
    "这时——\nその時"
    #特效
    "【喀嚓】闪光特效\nカシャー"
    show 小东 4111:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "呀！！\nきゃーー！！"
    "猝不及防，整个人猛得发抖，迅速蹲下来抱住了头\n思わず震えてしまって、しゃがみながら頭を抱いた"
    ？？？ "啊……\nあっ…"
    "然而，背后传来的是一个稍显弱气的声音\nしかし、背中から聞こえたのは少し弱気な声でした"
    "战战兢兢回过头来，发现那是一个穿着类似巫女服的短装、举着相机的长发少女\n怖がってて振り向けば、あそこにいるのは巫女服らしい短い上着を着て、カメラを持ってる髪の長い少女だった"
    "看来，刚才是快门和闪光灯闹出的的动静\nどうやら、さっきのはシャッターとフラッシュの騒ぎのようだ"
    ？？？ "对不起……\nごめんなさい…"
    show 小东 5111:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "（又来了！）\nまた来た！"
    "熟悉的游戏角色，再次出现了\nよく知っているゲームのキャラクターがまた現れた"
    "看到她的瞬间，不知为何，我的心情反而轻松下来，缓了口气\n彼女を見た瞬間、なんだか気持ちが軽くなって、ほっとした"
    show 小东 7012:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "（如果没记错的话，是零濡鸦之巫女的——）\n（覚え違いじゃなかったら、彼女は『零 ～濡鴉ノ巫女～』の…！）"
    show 小东 1022:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东"不来方夕莉，对吧？\n夕莉たんだ！"
    "没想到的是，我刚开口，对方反而被吓了一跳\nまさか喋り出したら、相手の方がびっくりした"
    "她皱起眉，后退几步\n彼女は眉をひそめて、後ろに少し下げた"
    不来方夕莉 "你、你认识我吗？\n彼女は眉をひそめて、後ろに少し下げた"
    show 小东 4121:
        zoom 0.5
        right
        crop(0,0,2000,1800)   
    小东"遭……\nしまっ…"
    "话脱口而出，才发现有不对劲的地方\n口に出したら変なところに気づいた"
    "之前的“凉宫杏树”和“森岛遥”，在游戏里是npc的角色\nこの前の「涼宮杏樹」と「森島遥」は、ゲームのNPCだった"
    "我都是以小东这个身份，去和她们结识的，所以才会一上来就认识\nひとなはこっひー/小東君として彼女たちと知り合った。だから最初から知った状態だった"
    "但现在的“不来方夕莉”，在《零：濡鸦之巫女》里是需要操纵的主角，没有这个关系的基础\nけど今の「不来方夕莉」は、『零 ～濡鴉ノ巫女～』で使うキャラで、そういう基礎となる関係はなかった"
    "也就是说，即便我认识这孩子\nつまり、ひとなはこの子を知ったとしても"
    "但在她看来，我就是一个出现在诡异场景里的陌生人、可疑人士\n彼女から見て、ひとなはこんな不思議な場所にいるただの見知らぬ人、怪しい者でしかない"
    show 小东 2113:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "你听我说你听我说，我叫小东人鱼，被困在了这里，想要逃出去。\nあの…小東ひとなと言います。ちょっとお聞きしたいんですが、今ここに閉じ込められて逃げ出せなくて…"
    "为了化解信任危机，我只能快速地做了个简单的自我介绍\n信頼させるため、簡単な自己紹介をした"
    小东 "……总之，你知道要怎么离开这里吗？\n…とりあえず、どうすればここから出られるの？"
    "都这么久了，再迟钝也该发现\nこんなに時間が経ったし、いくら鈍くても気付くんだろう"
    "这个走廊完全就属于超自然的现象，根本没办法走出去\nこの廊下は完全にオカルトっていて、歩くだけじゃ全然抜け出せない"
    "这时候，就得求助专家了\nこういう時こそ、プロに頼もう"
    不来方夕莉 "嗯……\nうん…"
    "她还是保持着一定距离\n彼女はまだ距離を取っている"
    小东 "拜托了！\nお願い！"
    不来方夕莉 "嗯，怎么逃出去，我是知道的\nふむ。脱出の方法は知っているよ。"
    不来方夕莉 "不，不如说我就是为此而来的。\nいや、むしろ私はこれを教えるためにここに来た。"
    不来方夕莉 "你发现了吗？这里凝固着大量的阴影。\n気づいていたのだろうか。ここには大量の影が固まっていて、"
    不来方夕莉 "锁住了所有的出口，形成了永久的无限走廊。\n全ての出口を塞がれているから、この無限に続く廊下が出来ているのだ。"
    show 小东 7012:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "嗯。\nうん。"
    "我点了点头，示意自己在认真听\nちゃんと聴いてるのを示すために頭を頷いていた"
    "但其实这些，早就是在游戏里就听过的设定\nとは言え、これらは既にゲームで聞いた設定なんだ"
    "这位拥有“影见”能力的少女，能看到过去的幻影、或是死者等不该存在的事物\nこの「影見」という能力を持つ少女は過去の残影、あるいは死者など、「ありえないもの」が見えるんだ"
    不来方夕莉"这是“射影机”，能够击退和封印怨灵，也能够用来破开这里的结界。\nこれが「射影機」。怨霊を撃退することと封印することができるし、ここの結界を破壊することもできるよ。"

    #【图片】射影机
    show 小东 6122:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "那就拜托你了！\nではお願いします！"
    "我迅速双手合十，摆出了足够诚恳的姿势\n誠意を見せるように両手を合わせていた"
    不来方夕莉 "嗯。\nうん。"
    "出乎意料的是，她也很快就答应了\nすぐに応えてくれたのはちょっと意外だった"

    #─────────────────
    #─────────────────
    #【可以是考验反应速度的拍照游戏
    #或者是音游
    #想起来之前有看过一个半路变成音游的恐怖游戏十分生草
    #有什么别的小游戏类型的灵感也可以】

    #─────────────────

    $ quick_menu = False
    call screen musicgame
    $ quick_menu =True

jump part7