label part4:
    show 小东 2013:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "这到底是什么？\nこれはなんだろう？"
    "仔细观察了很久，还是没发现那盒草莓牛奶到底有什么特别的地方\nよく観察してたけど、特別なところは一つもなかった。"
    "感觉就是街边便利店能随便买到的类型\n街中のコンビニで普通に買えるドリンクのようだ。"
    show 小东 1013:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "难道说！喝下它以后，就能回到原来的世界了！\nもしやのもしや！これを飲んだら元の世界に戻れるのか！"
    "被自己乐观的念头逗笑了，摇了摇头\nポジティブ過ぎた自分に笑った。自分をこの非現実的な妄想から引き返すように軽く頭を振る。"
    小东 "算了，想太多了。\nいや、そんな都合いいことあるもんか。"
    小东 "还是当作紧急储备粮吧。\n一応非常食にしておこう。"
    "虽然现在还没感到口渴，但总会有用得着的机会\n未だ喉が渇いていないけど、いつか役に立つだろう。"
    show 小东 2113:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "说起来，这到底是哪里？\nところで、ここは一体どこだろう？"
    "布置得像是学校的走廊，但所有门窗都仿佛与空间固定在了一起，纹丝不动\n学校の廊下っぽく見えるけど、すべてのドアと窓はこの空間と一体化されたように、押しても開けない。"
    "这条道路，似乎永远没有尽头\nこの通路には、果てがないようだ。"
    小东 "讨厌……有点恐怖\n嫌だなぁ......なんだか怖い..."
    "好在灯光还算明亮，只是稍微有点安静过头了，耳边全是自己的脚步声\n幸い、明かりはちゃんと働いてる。ただ静かすぎただけのせいで、自分の足音しか聞こえてない。"
    "前方很快出现了个影子\nすこし歩いていたら、すぐにその先には人影が見えてきた。"
    show 小东 4111:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "！！"
    "刚要惊叫出声，却讶异的发现，那是个有些眼熟的身影\n驚きの声を上げるところ、その人影はどこかで見たことあったような気もした。"
    "高挑的身材、姣好的面容，穿着冬季制服的黑发蓝瞳少女，正站在走廊的半途\n細い体でわりと背が高い。真っ黒なロングでキレイな顔に青い瞳。その姿とした少女は今、廊下の真ん中に佇んでいる。"
    "游戏人物，再次出现了\nゲームキャラが再び出現した。"
    show 小东 5111:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "（这回是——圣诞之吻吗？）\n（今回は...もらっ、アマガミか。）"
    小东 "那个……森、森岛学姐？\nあの......も、森島先輩ですか？"
    森岛遥 "啊！是小东！\nあー！小東君だ！"
    "她快步跑了过来，我下意识的想后退一步，却被拉住了手腕\n早足で近づいてきた森島先輩に、ひとなは思わず一歩後ずさろうとしたかったが、手首から温もりを感じた。"
    show 小东 4211:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "（好近！）\n（近い...！）"
    "森岛学姐的脸贴了过来，两人之间仅仅几厘米的距离，几乎能感受到对方的呼吸\n森島先輩の顔との距離はただ数センチしかない。相手の息を感じれるほどの近さ。"
    森岛遥 "太好了！终于找到你了！\nよかった！やっと小東くんを見つけた！"
    "她可能没察觉到距离有多近，身体差不多都贴在一起了\n彼女はまだこの気まずい状況を気づいてないみたい。二人の体はほとんどくっつけているとも過言ではない。"
    show 小东 8012:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "（游戏里和现实中，完全是不一样的冲击力啊……）\n（現実での衝撃力はゲームの中とは全く違うな......）"
    show 小东 2013:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "呃、嗯，学姐，也在这里被困住了吗？\nえっと、その、森島先輩もここに閉じされてるんですか？"
    "试图镇静下来，切换了话题\nドキドキした鼓動を静めようとして、話題を変えてみた。"
    "好在她似乎没察觉到我的动摇，而是低着头呢喃了一句\nこっちの動揺を気づいてないみたいに、森島先輩は少し頷きながらなにかの独り言を言っている。"
    森岛遥 "呃…嗯……\nんー...その......"
    森岛遥 "恐怖的事情，不太拿手呢\n怖いことにはあんまり得意じゃないの"
    森岛遥 "一个人太害怕，都不知道要往哪边走了\n一人で怖すぎて、どっちに向かうのがいいのか分からなくなっちゃって..."
    "看着她为难的表情，我不知为何反而安心了下来，笑着牵起她的手\n森島先輩が困りそうな顔をしているのを見て、なんだか逆に落ち着きができた。微笑みながら森島先輩の手を握る。"
    森岛遥 "诶？\nええ？"
    show 小东 1021:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "既然这样的话，那就跟在我后面吧\nそれでは、僕についてきてください！"
    show 小东 12113:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "我来带学姐出去\n僕が先輩を連れ出します！"
    森岛遥 "小东……意外的强势啊\n小東君って......意外と強引だね。"
    "她愣了一下，但很快就笑了起来\n森島先輩はちょっと驚いたように一瞬ボーッとしてたけど、すぐ嬉しそうな笑顔をみせてくれた。"
    "随即，感受到手心被反握住了\nそして、握りしめされた触感も手から伝わってきた。"
    #─────────────────
    #─────────────────
    #游戏设置 
    #【预想是2D俯视角的平面迷宫小游戏
    #如果是生日庆祝的话 就不要带恐怖元素了
    #小东玩迷宫这件事本身已经够恐怖了】
    #迷宫除了弯曲的岔路外，总共有2个出口
    #原本是小东在前方学姐在后方，在半路设置一个关键岔路，学姐会绕到前方，试图带领小东去往第1出口
    #森岛遥 "小东……我觉得应该走这边。"
    #跟着她走的话，到某个点会回到起点
    #小东 "怎么会……好像又回到了这里。"
    #在关键岔路，决定不跟着学姐
    #小东 "不，这条路应该才是正解。"
    #小东 "跟我来吧。"
    #带着学姐前往第2出口，成功逃离
    #─────────────────
    #─────────────────
    hide 小东
    scene gray
    $ quick_menu = False

    call screen maze

    $ quick_menu = True

    jump part5