label part3:
    "深吸一口气，打开了最后的大门\n深く息を吸い込み、最後の扉を開く。"
    "推门而出后，看到的居然是个女孩子\n扉を越えて、最初に目に映ったのは一人の女の子だった。"
    "白色短发，小小的个子，穿着宽松的蓝色大衣和制服裙\n白い短髪でセーラー服を着ているこがたの体には、ゆったりとした青いコートが被られている。"
    "白袜和运动鞋，挎着个粉色的背包\n白いルーズソックスに運動靴、ピンク色の肩がけバッグをかけている。"
    ？？？ "数据库匹配成功，你好，我是KR-976。\nデータベースマッチング成功。初めてお会いいたします。私はKR-976です。"
    show 小东 5211:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "？？？"
    "这个外表，这个语气，这个意义不明的代号\nこの見た目、この口調、この意味不明なコード。"
    "太熟悉了，不对，但也不能说是熟人\n知っている人だ。でも、知り合いほどではない。"
    show 小东 7012:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "你是——\n君は..."
    show 小东 5211:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "（等等，什么情况，这孩子，不是雀魂里的角色吗？？）\n（待って、この状況は一体...？この子は雀魂のキャラじゃないか！？）"
    show 小东 5111:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "（没看错吧，当初还是氪金抽到的！）\n（間違ってなかったら、これはあの時課金して引いた子だ！）"
    "自称人工智能的游戏角色出现在了眼前，完全理解不了现状\n自称人工知能のゲームキャラが目の前に現れたせいで、全然現状を理解することができない。"
    show 小东 6122:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "呃、杏树酱……对吧？\nえっと、杏樹ちゃん......だよね？"
    show 杏树 at left:
        zoom 0.5
        crop(0,0,2000,1800)

    凉宫杏树 "不，我不是凉宫杏树，我是KR-976，人工智能。\nいいえ、涼宮杏樹ではございません。KR-976型、人工知能とお呼びください。"
    凉宫杏树 "（盯——）\n（ジーー）"
    "回过神来，才发现她一直盯着这边看\nちょっとボーッとした後、あの子がずっとこっちをジッと見つめていることを気づいた。"
    凉宫杏树 "向小东人鱼发出申请，是否愿意将手中的小熊交给KR-976？\n申請。そのくまのぬいぐるみを、KR-976に渡してくれませんか？"
    "原来她盯着的，是刚刚逃脱密室拿到的小熊\nあの子に見つめられているのはひとなじゃなく、さっきの密室で手に入れたぬいぐるみの方みたい。"
    show 小东 2013:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "嗯……\nんーー"
    show 小东 1012:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "算了算了，既然是异世界，什么都可能发生对吧，我就不问多余的问题了\nまぁいいか。異世界だし、なにが起こってもおかしくないよね。余計な質問はやめとこう。"
    show 小东 5211:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "你想要这个小熊？用来干什么？\nこのぬいぐるみが欲しの？何に使うの？"
    "我提着小熊的玩偶，举得很高，在凉宫杏树的头顶晃了晃\nくまのぬいぐるみを高くあげて、杏樹ちゃんの頭上でちょっと軽く振った。"
    "她踮起脚尖，伸着手努力够着，虽然脸上看不出焦急，但总感觉有些恼\n杏樹ちゃんは背を伸びながら、伸ばした手で精一杯届こうとしている。顔には見えないが、なんだか焦りしていそうだ。"
    #【CG】
    凉宫杏树 "唔——\nむーー"
    凉宫杏树 "KR-976，需要回收小熊\nKR-976には、くまのぬいぐるみの回収が必要です。"
    show 小东 5211:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "！！\n"
    show 小东 4111:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "等等等等……\nちょっとまって......"
    show 小东 13111:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "回收？什么意思？\n回収？それはどういう意味なの？"
    "面对我的问题，她却皱起眉，露出了十分困扰的表情\nひとなの質問に対して、杏樹ちゃんは眉をしかめて、困りそうな顔をしている。"
    凉宫杏树 "警告，警告，电量过低，无法继续工作。\n警告。バッテリーはもうすぐ切れます。機体の活動は中止になります。"
    "反应过来，才发现自己紧贴了过去，抓着她的肩膀\n気がついたら、自分はいつか杏樹ちゃんに近づき、あの子の肩を掴んでいる。"
    show 小东 4121:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "抱歉，有些激动……但还是希望你能告诉我，这真的很重要。\nす、すみません。つい......でもやっぱり教えて欲しい。これはひとなにとって本当にとても大事なことなんだ。"
    "她似乎知道什么关键的线索，说不定也知道怎么回去！\nあの子はなにか肝心な手がかりを知っているようだ。もしかしたら帰る方法も知っているかも！"
    "我松开手后，凉宫杏树闭起眼来，摇头晃脑，嘴里念叨着什么\n"
    show 小东 5211:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "（在模仿人工智能的思考方式？）\n（人工知能の思考モードを真似してるのかな？）"
    "等了几分钟，她得出了结论\n数分後、「計算」が終わった。"
    凉宫杏树 "疑问 人工智能利用网络跃迁的方式，和普通人类正常行走的道路\n疑問。ネットワークの遷移（せんい）を利用する人工知能は、普通に進化していく人間との間に"
    凉宫杏树 "两者是否在存在不可转换的差异？又或者存在智能学习的可能性？\n変化不可の差異が存在していますか？或いは知能的に学ぶ可能性は存在していますか？"
    show 小东 11011:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "呃……\nえっと......"
    "完全没听懂\n全然わかんない。"
    show 小东 1022:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "我明白了……\nわかりました......"
    "完全不明白，虽然还有许多疑问，但犹豫之后，还是把小熊交给眼前的少女\n全くわからないが、いろいろな疑問もまだ解明されていないが、少し躊躇った後ぬいぐるみを目前の少女に渡そうとした。"
    "她的眼睛似乎亮了片刻，但马上又恢复了平静的语气\n杏樹ちゃんの目は一瞬キラキラしたように見えたが、すぐ冷静であるいつもの口調に戻った。"
    凉宫杏树 "嗯，是KR-976想要的东西。\n確認。KR-976の欲しかったものです。"
    凉宫杏树 "今天就破例按照小东人鱼的喜好，允许你称呼我为杏树吧。\n今日は特別にあなたの好きに、私のことを杏樹と呼ぶことを許可しましょう。"
    "抱着小熊的少女，发出了奇妙的光芒。\nぬいぐるみを抱えている少女は奇妙な光を放し始めた。"
    "她的身形渐渐变得虚幻，似乎立刻就要被传送走了\n杏樹ちゃんの輪郭はだんだん曖昧で幻のようになってしまい、もうすぐ転移されそうに見えた。"
    凉宫杏树 "等再次相见以后……看你的表现再说。またお会いしたら......その時の話はまたあなたの活躍次第ですね。\n"
    show 小东 5111:
        zoom 0.5
        right
        crop(0,0,2000,1800)
    小东 "啊——\nあっ"
    "告别还没来得及说出口，她突然小跑过来，将一件东西塞进了我的怀里\n告別を告げようとするところ、杏樹ちゃんは小走りになにかをひとなの懐に置いてきた。"
    凉宫杏树 "……草莓牛奶很重要。\n......イチゴミルクは大事です。"
    #图片#
    #"【图片】一盒粉色的草莓牛奶"
    "声音有些模糊，没听清她说什么\nぼんやりとした声で聞き取ることはできなかった。"
    "再次抬起头来，却发现眼前的少女已然消失不见\n二度と顔を上げたら、目先にいるはずの少女の姿はもうどこにも存在していない。"
    jump part4